trade_exp/src/InformationRegisters/НастройкиПользователейТелефонии/НастройкиПользователейТелефонии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="24ffa039-62cc-41de-aaab-57473eaef6f7">
  <name>НастройкиПользователейТелефонии</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e26cf146-642e-42c7-9e34-6edc9f585526">
    <name>ВнутреннийНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="30d99e09-261b-4766-ba06-bdf421fbe99d">
    <name>ИсходящийНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="23527951-730b-4eda-8fab-a0986aee8901">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/CommonModules/ТелефонияВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьОбсуждениеЖурналЗвонков() Экспорт
	
	Возврат ТелефонияСервер.СоздатьОбсуждениеЖурналЗвонков();
	
КонецФункции

Функция ИдентификаторОбсужденияЖурналЗвонков() Экспорт
	
	Возврат ТелефонияСервер.ИдентификаторОбсужденияЖурналЗвонков();
	
КонецФункции

Функция ОбработатьЗвонок(НомерКонтакта, Пользователь, ДатаЗвонка, ТипЗвонка, ВариантСобытия) Экспорт
	
	Возврат ТелефонияСервер.ОбработатьЗвонок(НомерКонтакта, Пользователь, ДатаЗвонка, ТипЗвонка, ВариантСобытия);
	
КонецФункции

Функция ПолучитьДанныеВходящегоЗвонка(ОчиститьДанные = Неопределено) Экспорт
	
	Возврат ТелефонияСервер.ДанныеВходящегоЗвонкаТекущегоПользователя(ОчиститьДанные);
	
КонецФункции

Функция СсылкаНаЗаписьРазговора(ИдентификаторЗвонкаВАТС, Ошибка) Экспорт
	
	Возврат ТелефонияСервер.СсылкаНаЗаписьРазговора(ИдентификаторЗвонкаВАТС, Ошибка);
	
КонецФункции

Процедура ОбновитьЖурналЗвонков() Экспорт
	
	ТелефонияСервер.ОбновитьЖурналЗвонков();
	
КонецПроцедуры

Процедура ПозвонитьПоНомеру(НомерАбонента, Событие, Ошибка, СтрокаПояснения) Экспорт
	
	ТелефонияСервер.ПозвонитьПоНомеру(НомерАбонента,,, Событие, Ошибка, СтрокаПояснения);
	
КонецПроцедуры

#КонецОбласти

#Область Astr

Функция AstrДокументТелефонии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	Возврат Константы.AstrДокументТелефонии.Получить();
	
КонецФункции

Функция УстановитьСтек() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если (Константы.ИспользуемаяАТС.Получить()=Перечисления.ДоступныеАТС._1Servic_Астериск) Тогда	
		ТекПользователь_ = ПараметрыСеанса.ТекущийПользователь;	
		Если ТекПользователь_<>Справочники.Пользователи.ПустаяСсылка()  Тогда	
			_менеджерЗаписи                   =РегистрыСведений._1Servic_Стек_Пользователей_Упрощенный.СоздатьМенеджерЗаписи();
			_менеджерЗаписи.Пользователь      =ТекПользователь_;
			_ВН_Номер                         =ВернутьВнутреннийНомерТекПользователя(ТекПользователь_);
			_менеджерЗаписи.ВнутреннийНомер   =_ВН_Номер;
			_менеджерЗаписи.Записать(Истина);		
		КонецЕсли;		
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецФункции 

Функция ВернутьВнутреннийНомерТекПользователя(ТекПользователь_) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер
	|ИЗ
	|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
	|ГДЕ
	|	НастройкиПользователейТелефонии.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь_);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		возврат ВыборкаДетальныеЗаписи.ВнутреннийНомер; 	
	Иначе
		возврат "Номера нет"
	КонецЕсли;
	
КонецФункции

Функция ИспользуемаяАТС_Получить() Экспорт
	
	возврат	Константы.ИспользуемаяАТС.Получить();
	
КонецФункции

#КонецОбласти
